Revit 2027 API
BuiltInFailures.ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindFormulaInFamily Property
 Can't change connection type to Feed Through Lugs because Feed Through Lugs is unchecked. Enable Feed Through Lugs with related formula in family editor the Feed Through Lugs is mapped to. Select the panel -> Edit Family -> Family Types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FeedThroughLugsIsNotEnabledAndBindFormulaInFamily { get; }
Public Shared ReadOnly Property FeedThroughLugsIsNotEnabledAndBindFormulaInFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FeedThroughLugsIsNotEnabledAndBindFormulaInFamily {
	FailureDefinitionId^ get ();
}
static member FeedThroughLugsIsNotEnabledAndBindFormulaInFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace